---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WitnsLineExtension
source: html/caa3d020-68ec-a6d6-98ca-ad58641f7319.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WitnsLineExtension Property

"Witness Line Extension"

## Syntax (C#)
```csharp
public static ForgeTypeId WitnsLineExtension { get; }
```